Revit 2024 API
LoadCase.NatureId Property
 The nature ID of the load case.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public ElementId NatureId { get; set; }
Visual Basic
Public Property NatureId As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ NatureId {
	ElementId^ get ();
	void set (ElementId^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: the natureId does not refer to LoadNature element.
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
LoadCase Class
Autodesk.Revit.DB.Structure Namespace